In [1]:
import pymysql
from sqlalchemy import create_engine

In [4]:
engine = create_engine("mysql+pymysql://root:admin@127.0.0.1/org")

In [5]:
import pandas as pd

In [9]:
df= pd.read_sql_table('worker',con=engine,index_col='WORKER_ID')
df.head()

          FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
WORKER_ID
1             Monika     Arora  100000 2014-02-20 09:00:00         HR
2           Niharika     Verma   80000 2014-06-11 09:00:00      Admin
3             Vishal   Singhal  300000 2014-02-20 09:00:00         HR
4            Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
5              Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   FIRST_NAME    8 non-null      object
 1   LAST_NAME     8 non-null      object
 2   SALARY        8 non-null      int64
 3   JOINING_DATE  8 non-null      datetime64[ns]
 4   DEPARTMENT    8 non-null      object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 384.0+ bytes

In [13]:
df

          FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
WORKER_ID
1             Monika     Arora  100000 2014-02-20 09:00:00         HR
2           Niharika     Verma   80000 2014-06-11 09:00:00      Admin
3             Vishal   Singhal  300000 2014-02-20 09:00:00         HR
4            Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
5              Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
6              Vipul     Diwan  200000 2014-06-11 09:00:00    Account
7             Satish     Kumar   75000 2014-01-20 09:00:00    Account
8            Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

In [16]:
engine.dispose()